emacs.d.org
# -*- eval: (my/org-config-mode) -*-

#+TITILE: Emacs configuration

* Early-init
:PROPERTIES:
:header-args: :tangle ./early-init.el
:END:

Emacs 27 introduces early-init.el, which is run before init.el, before package and UI initialization happens.

** Header

#+begin_src emacs-lisp
	
  ;; -*- lexical-binding: t -*-

#+end_src

** Early-init

#+begin_src emacs-lisp

  ;; Defer garbage collection further back in the startup process
  (setq gc-cons-threshold most-positive-fixnum)

  ;; Package initialize occurs automatically, before `user-init-file' is
  ;; loaded, but after `early-init-file'. We handle package
  ;; initialization, so we must prevent Emacs from doing it early!
  (setq package-enable-at-startup nil)

  ;; Faster to disable these here (before they've been initialized)
  (push '(menu-bar-lines . 0) default-frame-alist)
  (push '(tool-bar-lines . 0) default-frame-alist)
  (push '(vertical-scroll-bars) default-frame-alist)
  (when (featurep 'ns)
    (push '(ns-transparent-titlebar . t) default-frame-alist))

#+end_src

* Init
:PROPERTIES:
:header-args: :tangle ./init.el
:END:

** Header

#+begin_src emacs-lisp

  ;; -*- lexical-binding: t no-byte-compile: t -*-

#+end_src

** Speed up startup

#+begin_src emacs-lisp

  (defvar centaur-gc-cons-threshold (if (display-graphic-p) 16000000 1600000)
    "The default value to use for `gc-cons-threshold'. If you experience freezing,
  decrease this. If you experience stuttering, increase this.")

  (defvar centaur-gc-cons-upper-limit (if (display-graphic-p) 400000000 100000000)
    "The temporary value for `gc-cons-threshold' to defer it.")

  (defvar centaur-gc-timer (run-with-idle-timer 10 t #'garbage-collect)
    "Run garbarge collection when idle 10s.")

  (defvar default-file-name-handler-alist file-name-handler-alist)

  (setq file-name-handler-alist nil)
  (setq gc-cons-threshold centaur-gc-cons-upper-limit
        gc-cons-percentage 0.5)
  (add-hook 'emacs-startup-hook
            (lambda ()
              "Restore defalut values after startup."
              (setq file-name-handler-alist default-file-name-handler-alist)
              (setq gc-cons-threshold centaur-gc-cons-threshold
                    gc-cons-percentage 0.1)

              ;; GC automatically while unfocusing the frame
              ;; `focus-out-hook' is obsolete since 27.1
              (if (boundp 'after-focus-change-function)
                  (add-function :after after-focus-change-function
                                (lambda ()
                                  (unless (frame-focus-state)
                                    (garbage-collect))))
                (add-hook 'focus-out-hook 'garbage-collect))

              ;; Avoid GCs while using `ivy'/`counsel'/`swiper' and `helm', etc.
              ;; @see http://bling.github.io/blog/2016/01/18/why-are-you-changing-gc-cons-threshold/
              (defun my/minibuffer-setup-hook ()
                (setq gc-cons-threshold centaur-gc-cons-upper-limit))

              (defun my/minibuffer-exit-hook ()
                (setq gc-cons-threshold centaur-gc-cons-threshold))

              (add-hook 'minibuffer-setup-hook #'my/minibuffer-setup-hook)
              (add-hook 'minibuffer-exit-hook #'my/minibuffer-exit-hook)))

#+end_src

** Startup theme

#+begin_src emacs-lisp

  ;; Hide cursor and mode-line at startup
  (setq-default mode-line-format nil)
  (internal-show-cursor nil nil)

#+end_src

** Load path

#+begin_src emacs-lisp

  ;; Optimize: Force "lisp" at the head to reduce the startup time.
  (defun update-load-path (&rest _)
    "Update `load-path'."
    (dolist (dir '("lisp"))
      (push (expand-file-name dir user-emacs-directory) load-path)))

  (advice-add #'package-initialize :after #'update-load-path)

  (update-load-path)
	
#+end_src

** Packages

#+begin_src emacs-lisp

  ;; Without this comment Emacs25 adds (package-initialize) here
  (require 'init-package)

  ;; Preferences
  (require 'init-basic)
  ;; (require 'init-hydra)

  (require 'init-ui)
  (require 'init-evil)
  (require 'init-edit)
  (require 'init-ivy)
  (require 'init-completion)
  (require 'init-snippets)

  (require 'init-highlight)
  (require 'init-ibuffer)
  (require 'init-window)
  (require 'init-treemacs)

  ;; (require 'init-eshell)
  ;; (require 'init-shell)

  ;; (require 'init-markdown)
  (require 'init-org)

  (require 'init-utils)

  ;; Programming
  (require 'init-vcs)
  ;; (require 'init-flycheck)
  (require 'init-projectile)

  (require 'init-prog)
  (require 'init-elisp)
  (require 'init-tex)

#+end_src

* Basic
:PROPERTIES:
:header-args: :tangle ./lisp/init-basic.el
:END:

Better defaults configurations.

** Header

#+begin_src emacs-lisp

  ;; -*- lexical-binding: t -*-

  (require 'init-custom)
  (require 'init-funcs)
	
#+end_src

** Personal information

#+begin_src emacs-lisp

  (setq user-full-name    "none"
        user-mail-address "none")
	
#+end_src

** Encoding

#+begin_src emacs-lisp

  ;; UTF-8 as the default coding system
  (when (fboundp 'set-charset-priority)
    (set-charset-priority 'unicode))

  ;; Explicitly set the prefered coding systems to avoid annoying prompt
  ;; from emacs (especially on Microsoft Windows)
  (prefer-coding-system          'utf-8)
  (setq locale-coding-system     'utf-8)

  (set-language-environment      'utf-8)
  (set-default-coding-systems    'utf-8)
  (set-buffer-file-coding-system 'utf-8)
  (set-clipboard-coding-system   'utf-8)
  (set-file-name-coding-system   'utf-8)
  (set-keyboard-coding-system    'utf-8)
  (set-terminal-coding-system    'utf-8)
  (set-selection-coding-system   'utf-8)
  (modify-coding-system-alist    'process "*" 'utf-8)

#+end_src

** Keep Folders Clean

#+begin_src emacs-lisp

  (shell-command "rm -f ~/.emacs.d/session.*")
  (shell-command "rm -f ~/.emacs.d/org-src-*.txt")

#+end_src

** Fonts

#+begin_src emacs-lisp

  (defun my/set-font-faces ()
    ;; Set the font face based on platform
    (set-face-attribute 'default nil :font "SauceCodePro Nerd Font" :weight 'regular :height 125)

    ;; Set the fixed pitch fac
    (set-face-attribute 'fixed-pitch nil :font "SauceCodePro Nerd Font" :weight 'regular :height 125)

    ;; Set the variable pitch face
    (set-face-attribute 'variable-pitch nil :font "SauceCodePro Nerd Font" :height 125 :weight 'regular))

  (if (daemonp)
      (add-hook 'after-make-frame-functions (lambda (frame)
                                              (with-selected-frame frame
                                                (my/set-font-faces))))
    (my/set-font-faces))

#+end_src

** History
*** saveplace

#+begin_src emacs-lisp
	
  (use-package saveplace
    :ensure nil
    :hook (after-init . save-place-mode))

#+end_src

*** savehist

#+begin_src emacs-lisp

  (use-package savehist
    :ensure nil
    :hook (after-init . savehist-mode)
    :init (setq enable-recursive-minibuffers t ; Allow commands in minibuffers
                history-length 1000
                savehist-additional-variables '(mark-ring
                                                global-mark-ring
                                                search-ring
                                                regexp-search-ring
                                                extended-command-history)
                savehist-autosave-interval 300))

#+end_src

*** simple

#+begin_src emacs-lisp

  (use-package simple
    :ensure nil
    :hook ((after-init            . size-indication-mode)
           ((prog-mode conf-mode) . enable-trailing-whitespace))
    :init
    (setq column-number-mode          t
          line-number-mode            t
          line-move-visual            nil
          track-eol                   t   ; Keep cursor at end of lines. Require line-move-visual is nil.
          set-mark-command-repeat-pop t)  ; Repeating C-SPC after popping mark pops it again

    ;; Visualize TAB, (HARD) SPACE, NEWLINE
    (setq-default show-trailing-whitespace nil) ; Don't show trailing whitespace by default
    (defun enable-trailing-whitespace ()
      "Show trailing spaces and delete on saving."
      (setq show-trailing-whitespace t)
      (add-hook 'before-save-hook #'delete-trailing-whitespace nil t)))

#+end_src

*** so-long

#+begin_src emacs-lisp

  (use-package so-long
    :ensure nil
    :hook (after-init . global-so-long-mode)
    :config (setq so-long-threshold 400))

#+end_src

** Mouse & Smooth Scroll

Scroll one line at a time (less "jumpy" than defaults)

#+begin_src emacs-lisp

  (when (display-graphic-p)
    (setq mouse-wheel-scroll-amount     '(1 ((shift) . 1))
          mouse-wheel-progressive-speed nil))

  (setq scroll-step           1
        scroll-margin         7
        scroll-conservatively 100000)

#+end_src

** Keybinding

#+begin_src emacs-lisp

  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)
  (global-set-key (kbd "C-S-n")    'make-frame-command)
  (global-set-key (kbd "M-k")      nil)

  (use-package general
    :config
    (general-create-definer leader-key-def
      :keymaps '(normal
                 insert
                 visual
                 emacs
                 magit-status-mode-map
                 magit-log-mode-map)
      :prefix "SPC"
      :global-prefix "C-SPC"))

  (leader-key-def
    "hk"  'helpful-key
    "hv"  'counsel-describe-variable
    "hf"  'counsel-describe-function
    "hF"  'counsel-describe-face
    "hs"  'counsel-describe-symbol
    "ch"  'counsel-command-history
    "SPC" (lambda ()
            (interactive)
            (let ((file-path (my/lf-select-file default-directory)))
              (unless (equal file-path "cancel")
                (find-file file-path))))
    "q"   (lambda ()
            (interactive)
            (cond ((bound-and-true-p previous-major-mode-is-org) (my/org-edit-src-exit))
                  ((bound-and-true-p with-editor-mode)           (with-editor-cancel t))
                  (t                                             (evil-quit))))
    "a"   'mark-whole-buffer
    "s"   'my/open-org-file
    "bb"  'counsel-switch-buffer
    "pl"  'counsel-package
    "pr"  'package-refresh-contents
    "wd"  'delete-other-windows)

#+end_src

** Indentation

#+begin_src emacs-lisp

  (setq-default tab-width 4)
  (setq indent-tabs-mode nil)

  (defun disable-tabs ()
    (setq indent-tabs-mode nil))

  (defun enable-tabs  ()
    (local-set-key (kbd "TAB") 'tab-to-tab-stop)
    (setq indent-tabs-mode t))

#+end_src

