emacs.d.org
** Misc

#+begin_src emacs-lisp

  (fset 'yes-or-no-p 'y-or-n-p)
  (setq-default major-mode       'text-mode
                fill-column      100)

  (setq visible-bell                    t
        inhibit-compacting-font-caches  t    ; Don’t compact font caches during GC.
        delete-by-moving-to-trash       t    ; Deleting files go to OS's trash folder
        make-backup-files               nil  ; Forbide to make backup files
        auto-save-default               nil  ; Disable auto save
        confirm-kill-processes          nil  ; Disable confirm killing processes on exit
        enable-local-variables          :all ; Disable confirm to set local variables
        uniquify-buffer-name-style      'post-forward-angle-brackets ; Show path if names are same
        adaptive-fill-regexp            "[ t]+|[ t]*([0-9]+.|*+)[ t]*"
        adaptive-fill-first-line-regexp "^* *$"
        sentence-end                    "\\([。！？]\\|……\\|[.?!][]\"')}]*\\($\\|[ \t]\\)\\)[ \t\n]*"
        sentence-end-double-space       nil)

#+end_src

** End

#+begin_src emacs-lisp

  (provide 'init-basic)

#+end_src

* Completion
:PROPERTIES:
:header-args: :tangle ./lisp/init-completion.el
:END:

Auto-completion configurations.

** Header

#+begin_src emacs-lisp

  ;; -*- lexical-binding: t -*-

  (require 'init-custom)
  (require 'init-funcs)
	
#+end_src

** company

#+begin_src emacs-lisp

  (use-package company
    :diminish
    :bind (:map company-active-map
                ("<tab>"     . company-complete-common-or-cycle)
                ("<backtab>" . company-select-previous))
    :hook ((after-init . global-company-mode))
    :init
    (setq company-tooltip-align-annotations t
          company-tooltip-limit             12
          company-idle-delay                0
          company-minimum-prefix-length     2
          company-box-scrollbar             nil
          company-require-match             nil
          company-dabbrev-ignore-case       nil
          company-dabbrev-downcase          nil))

#+end_src

** company-prescient

Better sorting and filtering

#+begin_src emacs-lisp

  (use-package company-prescient
    :after company
    :init
    (company-prescient-mode 1))

#+end_src

** company-box

#+begin_src emacs-lisp

  (use-package company-box
    :after company
    :diminish
    :defines company-box-icons-all-the-icons
    :hook (company-mode . company-box-mode)
    :init (setq company-box-enable-icon     t
                company-box-backends-colors nil
                company-box-doc-enable      nil)
    :config
    (when (display-graphic-p)
      (declare-function all-the-icons-faicon   'all-the-icons)
      (declare-function all-the-icons-material 'all-the-icons)
      (declare-function all-the-icons-octicon  'all-the-icons)
      (setq company-box-icons-all-the-icons
            `((Unknown       . ,(all-the-icons-material "find_in_page"             :height 0.8  :v-adjust -0.15                             ))
              (Text          . ,(all-the-icons-faicon   "text-width"               :height 0.8  :v-adjust -0.02                             ))
              (Method        . ,(all-the-icons-faicon   "cube"                     :height 0.8  :v-adjust -0.02 :face 'all-the-icons-purple ))
              (Function      . ,(all-the-icons-faicon   "cube"                     :height 0.8  :v-adjust -0.02 :face 'all-the-icons-purple ))
              (Constructor   . ,(all-the-icons-faicon   "cube"                     :height 0.8  :v-adjust -0.02 :face 'all-the-icons-purple ))
              (Field         . ,(all-the-icons-octicon  "tag"                      :height 0.85 :v-adjust 0     :face 'all-the-icons-lblue  ))
              (Variable      . ,(all-the-icons-octicon  "tag"                      :height 0.85 :v-adjust 0     :face 'all-the-icons-lblue  ))
              (Class         . ,(all-the-icons-material "settings_input_component" :height 0.8  :v-adjust -0.15 :face 'all-the-icons-orange ))
              (Interface     . ,(all-the-icons-material "share"                    :height 0.8  :v-adjust -0.15 :face 'all-the-icons-lblue  ))
              (Module        . ,(all-the-icons-material "view_module"              :height 0.8  :v-adjust -0.15 :face 'all-the-icons-lblue  ))
              (Property      . ,(all-the-icons-faicon   "wrench"                   :height 0.8  :v-adjust -0.02                             ))
              (Unit          . ,(all-the-icons-material "settings_system_daydream" :height 0.8  :v-adjust -0.15                             ))
              (Value         . ,(all-the-icons-material "format_align_right"       :height 0.8  :v-adjust -0.15 :face 'all-the-icons-lblue  ))
              (Enum          . ,(all-the-icons-material "storage"                  :height 0.8  :v-adjust -0.15 :face 'all-the-icons-orange ))
              (Keyword       . ,(all-the-icons-material "filter_center_focus"      :height 0.8  :v-adjust -0.15                             ))
              (Snippet       . ,(all-the-icons-material "format_align_center"      :height 0.8  :v-adjust -0.15                             ))
              (Color         . ,(all-the-icons-material "palette"                  :height 0.8  :v-adjust -0.15                             ))
              (File          . ,(all-the-icons-faicon   "file-o"                   :height 0.8  :v-adjust -0.02                             ))
              (Reference     . ,(all-the-icons-material "collections_bookmark"     :height 0.8  :v-adjust -0.15                             ))
              (Folder        . ,(all-the-icons-faicon   "folder-open"              :height 0.8  :v-adjust -0.02                             ))
              (EnumMember    . ,(all-the-icons-material "format_align_right"       :height 0.8  :v-adjust -0.15                             ))
              (Constant      . ,(all-the-icons-faicon   "square-o"                 :height 0.8  :v-adjust -0.1                              ))
              (Struct        . ,(all-the-icons-material "settings_input_component" :height 0.8  :v-adjust -0.15 :face 'all-the-icons-orange ))
              (Event         . ,(all-the-icons-octicon  "zap"                      :height 0.8  :v-adjust 0     :face 'all-the-icons-orange ))
              (Operator      . ,(all-the-icons-material "control_point"            :height 0.8  :v-adjust -0.15                             ))
              (TypeParameter . ,(all-the-icons-faicon   "arrows"                   :height 0.8  :v-adjust -0.02                             ))
              (Template      . ,(all-the-icons-material "format_align_left"        :height 0.8  :v-adjust -0.15                             )))
            company-box-icons-alist 'company-box-icons-all-the-icons)))

#+end_src

** End

#+begin_src emacs-lisp

  (provide 'init-completion)

#+end_src

* Custom
:PROPERTIES:
:header-args: :tangle ./lisp/init-custom.el
:END:

Customization.

** Header

#+begin_src emacs-lisp

  ;; -*- lexical-binding: t -*-

#+end_src

** Custom definitions

#+begin_src emacs-lisp

  ;; Emacs Lisp Package Archive (ELPA)
  (defcustom centaur-package-archives-alist
    (let* ((no-ssl (and (memq system-type '(windows-nt ms-dos))
                        (not (gnutls-available-p))))
           (proto (if no-ssl "http" "https")))
      `(,(cons 'melpa
               `(,(cons "gnu"   (concat proto "://elpa.gnu.org/packages/"))
                 ,(cons "melpa" (concat proto "://melpa.org/packages/"))))
        ,(cons 'netease
               `(,(cons "gnu"   (concat proto "://mirrors.163.com/elpa/gnu/"))
                 ,(cons "melpa" (concat proto "://mirrors.163.com/elpa/melpa/"))))
        ,(cons 'ustc
               `(,(cons "gnu"   (concat proto "://mirrors.ustc.edu.cn/elpa/gnu/"))
                 ,(cons "melpa" (concat proto "://mirrors.ustc.edu.cn/elpa/melpa/"))))
        ,(cons 'tuna
               `(,(cons "gnu"   (concat proto "://mirrors.tuna.tsinghua.edu.cn/elpa/gnu/"))
                 ,(cons "melpa" (concat proto "://mirrors.tuna.tsinghua.edu.cn/elpa/melpa/"))))))
    "The package archives group list."
    :group 'centaur
    :type '(alist :key-type (symbol :tag "Archive group name")
                  :value-type (alist :key-type (string :tag "Archive name")
                                     :value-type (string :tag "URL or directory name"))))

  (defcustom centaur-package-archives 'melpa
    "Set package archives from which to fetch."
    :group 'centaur
    :set (lambda (symbol value)
           (set symbol value)
           (setq package-archives
                 (or (alist-get value centaur-package-archives-alist)
                     (error "Unknown package archives: `%s'" value))))
    :type `(choice ,@(mapcar
                      (lambda (item)
                        (let ((name (car item)))
                          (list 'const
                                :tag (capitalize (symbol-name name))
                                name)))
                      centaur-package-archives-alist)))

#+end_src

** End

#+begin_src emacs-lisp
	
  (provide 'init-custom)

#+end_src

* Edit
:PROPERTIES:
:header-args: :tangle ./lisp/init-edit.el
:END:

Editing configurations.

** Header

#+begin_src emacs-lisp

  ;; -*- lexical-binding: t -*-
	
  (require 'init-evil)
  (require 'init-basic)

#+end_src

** Russian keyboard

#+begin_src emacs-lisp

  (defun reverse-input-method (input-method)
    "Build the reverse mapping of single letters from INPUT-METHOD."
    (interactive
     (list (read-input-method-name "Use input method (default current): ")))
    (if (and input-method (symbolp input-method))
        (setq input-method (symbol-name input-method)))
    (let ((current current-input-method)
          (modifiers '(nil (control) (meta) (control meta))))
      (when input-method
        (activate-input-method input-method))
      (when (and current-input-method quail-keyboard-layout)
        (dolist (map (cdr (quail-map)))
          (let* ((to (car map))
                 (from (quail-get-translation
                        (cadr map) (char-to-string to) 1)))
            (when (and (characterp from) (characterp to))
              (dolist (mod modifiers)
                (define-key local-function-key-map
                  (vector (append mod (list from)))
                  (vector (append mod (list to)))))))))
      (when input-method
        (activate-input-method current))))

  (reverse-input-method 'russian-computer)

#+end_src

** delete-selection

Delete selection if you insert

#+begin_src emacs-lisp
	
  (use-package delsel
    :ensure nil
    :hook (after-init . delete-selection-mode))

#+end_src

** auto-revert

Automatically reload files was modified by external program

#+begin_src emacs-lisp
	
  (use-package autorevert
    :ensure nil
    :diminish
    :hook (after-init . global-auto-revert-mode))

#+end_src

** goto-addr

Click to browse URL or to send to e-mail address

#+begin_src emacs-lisp

  (use-package goto-addr
    :ensure nil
    :after evil
    :hook ((text-mode . goto-address-mode)
           (prog-mode . goto-address-prog-mode))
    :bind (:map evil-normal-state-map
                ("C-<return>" . goto-address-at-point)))

#+end_src

** avy

Jump to things in Emacs tree-style

#+begin_src emacs-lisp

  (use-package avy
    :after evil
    :bind (:map evil-normal-state-map
                ("/" . avy-goto-char-timer)
                :map evil-visual-state-map
                ("/" . avy-goto-char-timer)
                :map evil-motion-state-map
                ("/" . avy-goto-char-timer))
    :config
    (setq avy-all-windows     nil
          avy-timeout-seconds 0.4))

#+end_src

** aggressive-indent

Minor mode to aggressively keep your code always indented

#+begin_src emacs-lisp

  (use-package aggressive-indent
    :diminish
    :hook ((after-init . global-aggressive-indent-mode)
           ;; FIXME: Disable in big files due to the performance issues
           ;; https://github.com/Malabarba/aggressive-indent-mode/issues/73
           (find-file . (lambda ()
                          (if (> (buffer-size) (* 3000 80))
                              (aggressive-indent-mode -1)))))
    :config
    ;; Disable in some modes
    (dolist (mode '(asm-mode html-mode css-mode))
      (push mode aggressive-indent-excluded-modes))

    ;; Disable in some commands
    (add-to-list 'aggressive-indent-protected-commands #'delete-trailing-whitespace t)

    ;; Be slightly less aggressive in C/C++/Java/lua
    (add-to-list 'aggressive-indent-dont-indent-if
                 '(and (derived-mode-p 'c-mode 'c++-mode 'java-mode)
                       (null (string-match "\\([;{}]\\|\\b\\(if\\|for\\|while\\)\\b\\)"
                                           (thing-at-point 'line))))))

#+end_src

** comment-dwim-2

An all-in-one comment command to rule them all

#+begin_src emacs-lisp

  (use-package comment-dwim-2
    :init
    (leader-key-def
      "/" (lambda ()
            (interactive)
            (if (eq major-mode 'org-mode)
                (org-comment-dwim-2)
              (comment-dwim-2)))))

#+end_src

** electric-pair

Automatic parenthesis pairing

#+begin_src emacs-lisp

  (use-package electric-pair
    :ensure nil
    :hook (after-init . electric-pair-mode)
    :init
    (defvar my/exclude-electic-pair-modes '(latex-mode))

    (defun my/inhibit-electric-pair-mode (char)
      (member major-mode my/exclude-electic-pair-modes))

    (setq electric-pair-inhibit-predicate #'my/inhibit-electric-pair-mode))

#+end_src

** expand-region

Increase selected region by semantic units

#+begin_src emacs-lisp

  (use-package expand-region
    :after evil
    :bind (:map evil-visual-state-map
                ("<tab>"     . er/expand-region)
                ("<backtab>" . er/contract-region)))

#+end_src

** multiplite-regiton

#+begin_src emacs-lisp

  (use-package multiple-cursors
    :bind (("C-S-c C-S-c"   . mc/edit-lines)
           ("C->"           . mc/mark-next-like-this)
           ("C-<"           . mc/mark-previous-like-this)
           ("C-c C-<"       . mc/mark-all-like-this)
           ("C-M->"         . mc/skip-to-next-like-this)
           ("C-M-<"         . mc/skip-to-previous-like-this)
           ("s-<mouse-1>"   . mc/add-cursor-on-click)
           ("C-S-<mouse-1>" . mc/add-cursor-on-click)
           :map mc/keymap
           ("C-|"           . mc/vertical-align-with-space)))

#+end_src

** Goto last change

#+begin_src emacs-lisp

  (use-package goto-chg
    :after evil
    :bind (:map evil-normal-state-map
                (";" . goto-last-change)
                ("," . goto-last-change-reverse)))

#+end_src

** subword

Handling capitalized subwords in a nomenclature

#+begin_src emacs-lisp

  (use-package subword
    :ensure nil
    :diminish
    :hook ((prog-mode        . subword-mode)
           (minibuffer-setup . subword-mode)))

#+end_src

