emacs.d.org
** evil

#+begin_src emacs-lisp

  (use-package evil
    :hook (prog-mode . evil-mode)
    :bind ((:map evil-motion-state-map
                 ("RET" . nil)
                 ("M-k" . nil)
                 ("SPC" . nil)
                 ("DEL" . nil))
           (:map evil-normal-state-map
                 ("H"   . left-word)
                 ("L"   . right-word)
                 ("J"   . evil-forward-paragraph)
                 ("K"   . evil-backward-paragraph)
                 ("U"   . evil-redo)
                 ("M-h" . evil-window-increase-width)
                 ("M-l" . evil-window-decrease-width)
                 ("M-k" . evil-window-increase-height)
                 ("M-j" . evil-window-decrease-height)
                 ("C-p" . my/paste-from-clipboard)
                 ("y"   . my/copy-to-clipboard)
                 ("p"   . (lambda ()
                            (interactive)
                            (evil-paste-after 1)
                            (if (bound-and-true-p org-latex-mode)
                                (let ((start-point (mark t))
                                      (end-point   (point)))
                                  (if (> start-point end-point)
                                      (progn
                                        (setq-local temp-var end-point)
                                        (setq end-point   start-point
                                              start-point temp-var)))
                                  (org-display-inline-images nil t start-point end-point)
                                  (org--latex-preview-region start-point end-point))))))
           (:map evil-visual-state-map
                 ("H"   . left-word)
                 ("L"   . right-word)
                 ("J"   . evil-forward-paragraph)
                 ("K"   . evil-backward-paragraph)
                 ("p"   . my/paste-from-clipboard)
                 ("y"   . my/copy-to-clipboard))
           (:map evil-insert-state-map
                 ("M-k" . nil)
                 ("C-p" . my/paste-from-clipboard)))
    :custom (evil-want-keybinding nil)
    :config
    (global-set-key (kbd "C-l") 'evil-window-right)
    (global-set-key (kbd "C-h") 'evil-window-left)
    (global-set-key (kbd "C-k") 'evil-window-up)
    (global-set-key (kbd "C-j") 'evil-window-down)

    (define-key evil-insert-state-map [(shift backspace)] 'evil-delete-backward-word)

    (add-hook 'evil-visual-state-entry-hook (lambda () (prettify-symbols-mode -1)))
    (add-hook 'evil-visual-state-exit-hook  (lambda () (prettify-symbols-mode 1)))

    (evil-define-key '(normal insert visual)
      dashboard-mode-map (kbd "r") 'dashboard-jump-to-recents)
    (evil-define-key '(normal insert visual)
      dashboard-mode-map (kbd "p") 'dashboard-jump-to-projects)

    (use-package undo-fu
      :custom
      (evil-want-fine-undo  t)
      (evil-undo-system     'undo-fu)
      (evil-undo-function   'undo-fu-only-undo)
      (evil-redo-function   'undo-fu-only-redo))

    (defun my/paste-from-clipboard ()
      (interactive)
      (if (eq evil-visual-state-minor-mode t)
          (kill-region (region-beginning) (region-end)))
      (x-clipboard-yank)
      (goto-char (mark t)))

    (defun my/copy-to-clipboard ()
      (interactive)
      (setq select-enable-clipboard t)
      (call-interactively 'evil-yank)
      (setq select-enable-clipboard nil)))

#+end_src

** evil-collection

#+begin_src emacs-lisp

  (use-package evil-collection
    :after evil
    :init
    (evil-collection-init))

#+end_src

** key-chord

#+begin_src emacs-lisp

  (use-package key-chord
    :after evil
    :hook (evil-mode . key-chord-mode)
    :config
    (setq key-chord-two-keys-delay 0.15)
    (key-chord-define evil-insert-state-map (kbd "jj") 'evil-normal-state)

    (define-key evil-insert-state-map "о" #'my/maybe-exit)

    (evil-define-command my/maybe-exit ()
      :repeat change
      (interactive)
      (insert "о")
      (let ((evt (read-event "" nil 0.18)))
        (cond
         ((null evt))
         ((and (integerp evt) (char-equal evt ?о))
          (delete-char -1)
          (evil-normal-state))
         (t (insert evt))))))

#+end_src

** End

#+begin_src emacs-lisp
	
  (provide 'init-evil)

#+end_src

* Funcs
:PROPERTIES:
:header-args: :tangle ./lisp/init-funcs.el
:END:

Define functions.

** Header

#+begin_src emacs-lisp

  ;; -*- lexical-binding: t -*-
	
  (require 'cl-lib)
  (require 'init-custom)

#+end_src

** Open this file

#+begin_src emacs-lisp

  (defun my/open-org-file ()
    "Open `.emacs.d.org'."
    (interactive)
    (setq org-file (expand-file-name "emacs.d.org" user-emacs-directory))
    (message "Opening ~/.emacs.d/.emacs.d.org...")
    (find-file org-file)
    (message "Opening ~/.emacs.d/.emacs.d.org...done"))

#+end_src

** Misc

#+begin_src emacs-lisp

  (defun create-scratch-buffer ()
    "Create a scratch buffer."
    (interactive)
    (switch-to-buffer (get-buffer-create "*scratch*"))
    (lisp-interaction-mode))

  (defun recompile-elpa ()
    "Recompile packages in elpa directory. Useful if you switch Emacs versions."
    (interactive)
    (if (fboundp 'async-byte-recompile-directory)
        (async-byte-recompile-directory package-user-dir)
      (byte-recompile-directory package-user-dir 0 t)))

  (defun centaur-set-variable (variable value &optional no-save)
    "Set the VARIABLE to VALUE, and return VALUE.

  Save to `custom-file' if NO-SAVE is nil."
    (customize-set-variable variable value))

  (defun my/line-looking-at (regexp)
    (save-excursion
      (beginning-of-line)
      (looking-at-p regexp)))

  (defun my/current-line-empty-p ()
    (save-excursion
      (beginning-of-line)
      (looking-at-p "^[[:space:]]*$")))

  (defun my/search-buffer-name (regexp)
    (catch 'my-catch
      (let ((buffer-temp-name (make-temp-name "scratch-"))
            (regexp-buffer-name nil))
        (switch-to-buffer buffer-temp-name)
        (insert (mapconcat (function buffer-name) (buffer-list) "\n"))
        (goto-char (point-min))
        (if (re-search-forward regexp nil t)
            (setq regexp-buffer-name (match-string-no-properties 0)))
        (kill-buffer buffer-temp-name)
        (throw 'my-catch regexp-buffer-name))))

  (defun my/lf-select-file (path)
    (interactive)
    (shell-command-to-string (concat "[ ! -d ~/.cache/emacs/ ] && mkdir -p ~/.cache/emacs;"
                                     "echo -n \"\" > ~/.cache/emacs/path;"
                                     "awesome-client 'create_emacs_fm(\"" path "\")';"
                                     "while ! [ -s ~/.cache/emacs/path ]; do sleep 0.1; done"))
    (shell-command-to-string "cat ~/.cache/emacs/path"))

  ;; (defun my/test ()
  ;;   (interactive)
  ;;   (if (my/line-looking-at "^\\*+[[:ascii:]]*")
  ;; 	  (message "test")))

#+end_src

** Pakcage repository (ELPA)

#+begin_src emacs-lisp

  (defun set-package-archives (archives &optional refresh async no-save)
    "Set the package archives (ELPA).

  REFRESH is non-nil, will refresh archive contents.
  ASYNC specifies whether to perform the downloads in the background.
  Save to `custom-file' if NO-SAVE is nil."
    (interactive
     (list
      (intern (completing-read "Select package archives: "
                               (mapcar #'car centaur-package-archives-alist)))))
    ;; Set option
    (centaur-set-variable 'centaur-package-archives archives no-save)

    ;; Refresh if need
    (and refresh (package-refresh-contents async))

    (message "Set package archives to `%s'" archives))
  (defalias 'centaur-set-package-archives #'set-package-archives)

#+end_src

** Update

#+begin_src emacs-lisp

  (defvar centaur--updating-packages nil)
  (defun update-packages (&optional sync)
    "Refresh package contents and update all packages.

  If SYNC is non-nil, the updating process is synchronous."
    (interactive)
    (when centaur--updating-packages
      (user-error "Still updating packages..."))

    (message "Updating packages...")
    (if (and (not sync)
             (require 'async nil t))
        (progn
          (setq centaur--updating-packages t)
          (async-start
           `(lambda ()
              ,(async-inject-variables "\\`\\(load-path\\)\\'")
              (require 'init-funcs)
              (require 'init-package)
              (upgrade-packages)
              (with-current-buffer auto-package-update-buffer-name
                (buffer-string)))
           (lambda (result)
             (setq centaur--updating-packages nil)
             (message "%s" result)
             (message "Updating packages...done"))))
      (progn
        (upgrade-packages)
        (message "Updating packages...done"))))
  (defalias 'centaur-update-packages #'update-packages)

#+end_src

** End

#+begin_src emacs-lisp
	
  (provide 'init-funcs)

#+end_src

* Highlight
:PROPERTIES:
:header-args: :tangle ./lisp/init-highlight.el
:END:

Highlighting configurations.

** Header

#+begin_src emacs-lisp

  ;; -*- lexical-binding: t -*-
	
#+end_src

** Highlight the current line

#+begin_src emacs-lisp

  (use-package hl-line
    :ensure nil
    :hook (after-init . global-hl-line-mode))

#+end_src

