lisp/init-org.el
;; -*- lexical-binding: t -*-

(require 'init-evil)
(require 'init-basic)

(use-package org
  :defer t
  :after yasnippet
  :hook (org-mode . (lambda ()
                      (turn-on-auto-fill)
                      (variable-pitch-mode 1)
                      (diff-hl-mode 0)))
  :config
  (add-to-list 'auto-mode-alist '("\\.org$" . org-mode))
  (setq org-ellipsis                      " ▾ "
        org-src-fontify-natively          t
        org-src-tab-acts-natively         t
        org-edit-src-content-indentation  2
        org-hide-block-startup            nil
        org-src-preserve-indentation      nil
        org-cycle-separator-lines         2
        org-startup-folded                t
        org-src-window-setup              'current-window
        org-edit-src-persistent-message   nil
        org-return-follows-link           t
        org-startup-indented              t
        org-startup-with-inline-images    nil)

  (setcar (nthcdr 4 org-emphasis-regexp-components) 10)
  (org-set-emph-re 'org-emphasis-regexp-components org-emphasis-regexp-components)

  ;; Replace list hyphen with dot
  (font-lock-add-keywords 'org-mode
                          '(("^ *\\([-]\\) "
                             (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))

  (use-package org-bullets
    :hook (org-mode . org-bullets-mode)
    :custom
    (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")))

  (dolist (face '((org-level-1 . 1.2)
                  (org-level-2 . 1.15)
                  (org-level-3 . 1.10)
                  (org-level-4 . 1.05)
                  (org-level-5 . 1.0)
                  (org-level-6 . 1.0)
                  (org-level-7 . 1.0)
                  (org-level-8 . 1.0)))
    (set-face-attribute (car face) nil :font "SauceCodePro Nerd Font" :weight 'regular :height (cdr face)))

  ;; set local scroll-margin
  (add-hook 'org-mode-hook (lambda ()
                             (set (make-variable-buffer-local 'scroll-margin) 0)))

  (use-package visual-fill-column
    :hook (org-mode . visual-fill-column-mode)
    :config
    (setq-default visual-fill-column-width       110
                  visual-fill-column-center-text t))

  (use-package org-auto-tangle
    :hook (org-mode . org-auto-tangle-mode))

(use-package worf
  :after evil
  :bind ((:map evil-normal-state-map
               ("SPC t"           . worf-goto))
         (:map worf-mode-map
               ("<S-iso-lefttab>" . nil)
               ("["               . nil)
               ("]"               . nil)))
  :hook (org-mode . worf-mode))
