lisp/init-org.el

(setq org-latex-toc-command    "\\tableofcontents \\clearpage"
      org-format-latex-options (plist-put org-format-latex-options :scale 1.6)
      org-latex-create-formula-image-program 'imagemagick)

(with-eval-after-load 'ox-latex
  (add-to-list 'org-latex-classes
               '("org-plain-latex"
                 "\\documentclass{article}
                  [NO-DEFAULT-PACKAGES]
                  [PACKAGES]
                  [EXTRA]"
                 ("\\part{%s}"          . "\\part*{%s}")
                 ("\\section{%s}"       . "\\section*{%s}")
                 ("\\subsection{%s}"    . "\\subsection*{%s}")
                 ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                 ("\\paragraph{%s}"     . "\\paragraph*{%s}"))))

(use-package org-fragtog
  :hook (org-mode . org-fragtog-mode)
  :config
  (setq org-fragtog-preview-delay 0.25))

(defun my/update-theorem-and-lemma-counts ()
  (interactive)
  (setq latex-theorem-count 1
        latex-lemma-count   1)
  (save-excursion
    (goto-char (point-min))
    (while (re-search-forward "\\\\begin{theorem}" nil t)
      (setq latex-theorem-count (1+ latex-theorem-count)))
    (goto-char (point-min))
    (while (re-search-forward "\\\\begin{lemma}" nil t)
      (setq latex-lemma-count (1+ latex-lemma-count)))))


(defun my/change-environment ()
  (interactive)
  (save-excursion
    (goto-char (point-min))
    (if (save-excursion (re-search-forward "align" nil t))
        (replace-regexp "align" "gather")
      (replace-regexp "gather" "align"))))

(add-to-list 'display-buffer-alist '("*Async Shell Command*" display-buffer-no-window (nil)))

(defun my/org-latex-export ()
  (interactive)
  (setq tex-file-name (org-latex-export-to-latex))
  (shell-command-to-string (concat
                            "sd '^\\\\begin\\{theorem\\}' '\\\\begin{boxtheorem}' ./" tex-file-name ";"
                            "sd '^\\\\end\\{theorem\\}' '\\\\end{boxtheorem}' ./" tex-file-name ";"
                            "sd '^\\\\begin\\{lemma\\}' '\\\\begin{boxlemma}' ./" tex-file-name ";"
                            "sd '^\\\\end\\{lemma\\}' '\\\\end{boxlemma}' ./" tex-file-name ";"))
  (setq pdf-file-name (org-latex-compile tex-file-name))
  (async-shell-command (concat "evince " pdf-file-name) nil nil))

(defun my/get-org-latex-fragment-image ()
  (interactive)
  (catch 'my-catch
    (let* ((processing-info
            (cdr (assq org-preview-latex-default-process org-preview-latex-process-alist)))
           (face (face-at-point))
           ;; Get the colors from the face at point.
           (fg
            (let ((color (plist-get org-format-latex-options
                                    :foreground)))
              (if 'forbuffer
                  (cond
                   ((eq color 'auto)
                    (face-attribute face :foreground nil 'default))
                   ((eq color 'default)
                    (face-attribute 'default :foreground nil))
                   (t color))
                color)))
           (bg
            (let ((color (plist-get org-format-latex-options
                                    :background)))
              (if 'forbuffer
                  (cond
                   ((eq color 'auto)
                    (face-attribute face :background nil 'default))
                   ((eq color 'default)
                    (face-attribute 'default :background nil))
                   (t color))
                color)))
           (value (org-element-property :value (org-element-context)))
           (hash (sha1 (prin1-to-string
                        (list org-format-latex-header
                              org-latex-default-packages-alist
                              org-latex-packages-alist
                              org-format-latex-options
                              'forbuffer value fg bg))))
           (imagetype (or (plist-get processing-info :image-output-type) "png"))
           (prefix (concat org-preview-latex-image-directory "org-ltximg"))
           (absprefix (expand-file-name prefix default-directory))
           (movefile (format "%s_%s.%s" absprefix hash imagetype)))
      (throw 'my-catch movefile))))

(defun my/view-org-fragment ()
  (interactive)
  (unless (bound-and-true-p my/latex-window-frame)
    (async-start
     (progn
       (setq latex-fragment-buffer (get-buffer-create " *latex-fragment*"))
       (let ((latex-image-file   nil)
             (latex-image        nil)
             (latex-image-width  nil)
             (latex-image-height nil))
         (save-excursion
           (forward-char)
           (re-search-backward "(")
           (re-search-forward  "[[:digit:]]+")
           (re-search-backward (concat "\\\\tag{" (match-string-no-properties 0) "}"))
           (setq latex-image-file   (my/get-org-latex-fragment-image)
                 latex-image        (create-image latex-image-file)
                 latex-image-width  (car (image-size latex-image t))
                 latex-image-height (cdr (image-size latex-image t))))
         (with-current-buffer latex-fragment-buffer
           (insert "\n   ")
           (insert-image latex-image))
         (if (or (eq latex-image-height 85)
                 (eq latex-image-height 31))
             (setq latex-image-height (+ latex-image-height 10)))
         (setq my/latex-window-frame (posframe-show
                                      latex-fragment-buffer
                                      :position (point)
                                      :font "SauceCodePro Nerd Font 6"
                                      :width (floor (* latex-image-width 0.21))
                                      :height (+ 4 (floor (/ (- latex-image-height 22) 10.55)))
                                      :border-width 2
                                      :border-color "#32424b"
                                      :override-parameters '((parent-frame . nil)))))))
    (add-hook 'post-command-hook #'my/hide-org-fragment)))

(defun my/hide-org-fragment ()
  (interactive)
  (let ((current-postiton (point)))
    (unless (equal current-postiton my/previous-position)
      (if my/latex-window-frame
          (progn
            (posframe-delete-frame latex-fragment-buffer)
            (setq my/latex-window-frame nil)
            (evil-delete-buffer latex-fragment-buffer)
            (remove-hook 'post-command-hook #'my/hide-org-fragment))))))

(defun my/org-latex-mode ()
  (interactive)
  (setq-local org-src-window-setup    'split-window-below
              company-box-enable-icon nil
              org-latex-mode          t)
  (aas-activate-for-major-mode)
  (visual-line-mode t)
  (my/update-theorem-and-lemma-counts)
  (my/org-load-prettify-symbols)
  (my/remove-images)
  (add-hook 'org-pre-cycle-hook
            (lambda (arg)
              (cond ((eq arg 'children) (progn
                                          (org-narrow-to-subtree)
                                          (save-excursion
                                            (goto-char (point-min))
                                            (search-forward-regexp "^\*+ " nil t 2)
                                            (org-display-inline-images nil t (point-min) (point))
                                            (org--latex-preview-region (point-min) (point)))
                                          (widen)))
                    ((eq arg 'subtree)  (progn
                                          (org-narrow-to-subtree)
                                          (org-display-inline-images nil t (point-min) (point-max))
                                          (save-excursion
                                            (goto-char (point-min))
                                            (while (re-search-forward "^\\*+" nil t)
                                              (org-latex-preview nil)))
                                          (widen)))
                    ((eq arg 'folded)   (if (my/line-looking-at "^\\*+[[:ascii:]]*")
                                            (progn
                                              (org-narrow-to-subtree)
                                              (save-excursion
                                                (goto-char (point-min))
                                                (while (re-search-forward "^\\*+" nil t)
                                                  (org-latex-preview '(4))))
                                              (mapc #'delete-overlay (overlays-in (point-min) (point-max)))
                                              (widen))))))))
