lisp/init-org.el

(defun my/inkscape-figures-create ()
  (interactive)
  (setq img-file-path (shell-command-to-string "inkscape-figures create"))
  (if (not (equal img-file-path ""))
      (progn
        (insert img-file-path)
        (if (not (equal org-inline-image-overlays nil))
            (org-toggle-inline-images))
        (org-toggle-inline-images))
    (progn
      (evil-previous-line)
      (kill-whole-line 2))))

(defun my/inkscape-figures-edit (line-str)
  (interactive)
  (setq file-name (replace-regexp-in-string "\\[\\|\\]" "" line-str))
  (shell-command-to-string (concat "inkscape-figures edit " file-name))
  (org-toggle-inline-images)
  (org-toggle-inline-images))

(defun my/insert-image ()
  (interactive)
  (let ((image-path   (my/lf-select-file "~/Pictures/screenshots"))
        (image        nil)
        (image-width  nil)
        (image-height nil))
    (unless (equal image-path "cancel")
      (setq image        (create-image image-path)
            image-width  (car (image-size image t))
            image-height (cdr (image-size image t)))
      (if (or (> image-width 1050)
              (> image-height 600))
          (shell-command-to-string (concat "convert "
                                           image-path
                                           " -quality 100 -resize 1050x600 "
                                           image-path)))
      (setq image-path (shell-command-to-string (concat "inkscape-figures move " image-path)))
      (insert (concat "[[" image-path "]]"))
      (org-display-inline-images nil t (point-at-bol) (point-at-eol)))))

(defun my/remove-images ()
  (interactive)
  (message "Removing unused images...")
  (setq used-file-names-str "unused_name")
  (save-excursion
    (goto-char (point-min))
    (while (re-search-forward "\\[\\[\\./images/.+\\]\\]" nil t)
      (setq used-file-names-str (concat used-file-names-str
                                        "\\|"
                                        (replace-regexp-in-string "\\[\\|\\]"
                                                                  ""
                                                                  (match-string-no-properties 0))))))
  (shell-command-to-string (concat "find ./images/ -type f | grep -v \"" used-file-names-str "\" | xargs rm"))
  (message "Removing unused images...done"))

(defun my/isearch-line-forward (regexp-p)
  (catch 'my-catch
    (narrow-to-region (line-beginning-position) (line-end-position))
    (if (search-forward regexp-p nil t nil)
        (progn
          (widen)
          (throw 'my-catch t)))
    (widen)))

(defun my/just-one-space ()
  (insert "x")
  (if (my/isearch-line-forward "\\(")
      (progn
        (evil-backward-char 2)
        (delete-horizontal-space)))
  (backward-delete-char 1))

(defun my/org-edit-special ()
  (interactive)
  (if (and (bound-and-true-p org-latex-mode)
           (looking-at "(\\|)\\|[[:digit:]]+"))
      (save-excursion
        (setq my/previous-position (point))
        (narrow-to-region (line-beginning-position) (line-end-position))
        (if (or (looking-at "(")
                (re-search-backward "(" nil t))
            (progn
              (widen)
              (if (looking-at "([[:digit:]]+)")
                  (my/view-org-fragment)))
          (widen)))
    (let* ((line-str           (buffer-substring (line-beginning-position) (line-end-position)))
           (processed-line-str (replace-regexp-in-string "\\[\\[[[:word:]\\|\\.\\|/]*\\]\\]" "" line-str))
           (current-layout     (shell-command-to-string "xkb-switch -p")))
      (shell-command-to-string "xdotool key Mode_switch")
      (if (and (equal processed-line-str "")
               (not (equal line-str "")))
          (my/inkscape-figures-edit line-str)
        (progn
          (org-edit-special)
          (toggle-truncate-lines)
          (setq-local previous-major-mode-is-org t)
          (if (equal current-layout "ru\n")
              (setq change-lang t)
            (setq change-lang nil)))))))

(defun my/org-edit-src-exit ()
  (interactive)
  (yas-exit-all-snippets)
  (let ((latex-fragment nil))
    (if (equal (count-lines (point-min) (point-max)) 1)
        (progn
          (goto-char (- (point-max) 2))
          (delete-horizontal-space)
          (setq latex-fragment t))
      (setq latex-fragment nil))
    (org-edit-src-exit)
    (cond (change-lang                                   (shell-command-to-string "xkb-switch -n")))
    (cond ((bound-and-true-p org-jump-to-previous-block) (org-previous-block 1))
          (latex-fragment                                (progn
                                                           (if (org-in-item-p) (my/just-one-space))
                                                           (my/isearch-line-forward "\\)")
                                                           (org-latex-preview))))))

(defun my/org-insert-item-or-heading ()
  (interactive)
  (if (org-in-item-p)
      (org-insert-item)
    (org-insert-heading)))

(defun my/org-previous-visible-heading ()
  (interactive)
  (if (org-at-heading-p)
      (progn
        (save-excursion
          (previous-line)
          (if (org-at-heading-p)
              (setq prev-heading-folded t)
            (setq prev-heading-folded nil)))
        (if prev-heading-folded
            (outline-up-heading 1)
          (org-previous-visible-heading 1)))
    (org-previous-visible-heading 1)))

(evil-define-key '(normal insert visual) org-mode-map (kbd "C-k") 'evil-window-up)
(evil-define-key '(normal insert visual) org-mode-map (kbd "C-j") 'evil-window-down)
(evil-define-key '(normal insert)        org-mode-map (kbd "M-f") 'org-footnote-action)
(evil-define-key '(insert)               org-mode-map (kbd "C-i") 'my/org-insert-item-or-heading)

(leader-key-def
  "i"   'my/org-edit-special
  "m"   'org-mark-ring-goto
  "u"   'my/org-previous-visible-heading
  "d"   'org-next-visible-heading
  "ob"  'org-babel-tangle
  "op"  'org-latex-preview
  "oe"  'my/org-latex-export
  "ce"  'my/change-environment
  "rc"  'my/update-theorem-and-lemma-counts
  "TAB" 'evil-close-folds)

(defun my/org-config-mode ()
  (interactive)
  (setq org-jump-to-previous-block        t
        org-edit-src-auto-save-idle-delay 1
        org-auto-tangle-default           t))

)
