emacs.d.org
*** imenu-list

#+begin_src emacs-lisp

  (require 'imenu)

  (use-package imenu-list
    :after evil
    :init
    (setq imenu-list-focus-after-activation t
          imenu-list-idle-update-delay-time 0.2
          imenu-list-mode-line-format       nil
          imenu-list-position               'left
          imenu-list-size                   36)

    (defun my/org-sidebar-toggle ()
      "Toggle the org-sidebar"
      (interactive)
      (if (equal (buffer-name (current-buffer)) "*Ilist*")
          (imenu-list-smart-toggle)
        (progn
          (if (fboundp 'imenu-list-show)
              (progn
                (if (eq imenu-list-minor-mode nil)
                    (imenu-list-minor-mode))
                (imenu-list-show))
            (progn
              (imenu-list-smart-toggle)
              (setq-local evil-normal-state-cursor '(nil)))))))

    (evil-define-key '(normal) imenu-list-major-mode-map (kbd "q") 'imenu-list-smart-toggle)
    (evil-define-key '(normal) imenu-list-major-mode-map (kbd "<tab>") 'hs-toggle-hiding)

    (leader-key-def "n" 'my/org-sidebar-toggle)
    :config
    (set-face-attribute 'imenu-list-entry-face-0 nil :foreground "#51afef" :height 1.2 :weight 'regular)
    (set-face-attribute 'imenu-list-entry-face-1 nil :foreground "#c678dd" :height 1.15))

#+end_src

** COMMENT Org test

#+begin_src emacs-lisp

  (defun my/org-back-to-top-level-heading ()
    "Go back to the current top level heading."
    (interactive)
    (or (re-search-backward "^\* " nil t)
        (goto-char (point-min))))

  (defun ded/org-show-next-heading-tidily ()
    "Show next entry, keeping other entries closed."
    (interactive)
    (if (save-excursion (end-of-line) (outline-invisible-p))
        (progn (org-show-entry) (show-children))
      (outline-next-heading)
      (unless (and (bolp) (org-on-heading-p))
        (org-up-heading-safe)
        (hide-subtree)
        (error "Boundary reached"))
      (org-overview)
      (org-reveal t)
      (org-show-entry)
      (show-children)))

  (defun ded/org-show-previous-heading-tidily ()
    "Show previous entry, keeping other entries closed."
    (interactive)
    (let ((pos (point)))
      (outline-previous-heading)
      (unless (and (< (point) pos) (bolp) (org-on-heading-p))
        (goto-char pos)
        (hide-subtree)
        (error "Boundary reached"))
      (org-overview)
      (org-reveal t)
      (org-show-entry)
      (show-children)))

  (defun org-edit-preview-latex-fragment ()
    "Write latex fragment from source to parent buffer and preview it."
    (interactive)
    (org-src-in-org-buffer (org-preview-latex-fragment)))

#+end_src

** End

#+begin_src emacs-lisp

  )
	
  (provide 'init-org)

#+end_src

* Tex
:PROPERTIES:
:header-args: :tangle ./lisp/init-tex.el
:END:

** Header

#+begin_src emacs-lisp

  ;; -*- lexical-binding: t -*-
	
#+end_src

** Auctex

#+begin_src emacs-lisp

  (use-package auctex
    :hook ((LaTeX-mode . display-line-numbers-mode)
           (LaTeX-mode . turn-on-auto-fill)
           (LaTeX-mode . (lambda ()
                           (define-key LaTeX-mode-map "\C-j" 'nil)
                           (company-mode -1)
                           (my/latex-load-prettify-symbols))))
    :custom
    (TeX-auto-save                     t)
    (TeX-parse-self                    t)
    (TeX-PDF-mode                      t)
    (TeX-file-line-error               t)
    (TeX-source-correlate-start-server t)
    (preview-auto-cache-preamble       t)
    :config
    (setq-default TeX-master nil))

#+end_src

** COMMENT evil-tex

#+begin_src emacs-lisp

  (use-package evil-tex
    :hook (LaTeX-mode . evil-tex-mode))

#+end_src

** cdlatex

#+begin_src emacs-lisp

  (use-package cdlatex
    :after (evil yasnippet)
    :hook ((prog-mode  . turn-on-cdlatex)
           (cdlatex-tab . my/cdlatex-in-yas-field))
    :bind ((:map cdlatex-mode-map
                 ("<"     . nil)
                 ("("     . nil)
                 ("["     . nil)
                 ("{"     . nil)
                 ("|"     . nil)
                 ("_"     . nil)
                 ("'"     . nil)
                 ("`"     . nil)
                 ("$"     . nil))
           (:map evil-insert-state-map
                 ("<tab>" . expand-snippet-or-cdlatex-tab)))
    :config
    (defun do-yas-expand ()
      (let ((yas/fallback-behavior 'return-nil))
        (yas/expand)))

    (defun expand-snippet-or-cdlatex-tab ()
      (interactive)
      (if (or (not yas/minor-mode)
              (null (do-yas-expand)))
          (cdlatex-tab)))

    (defun my/cdlatex-in-yas-field ()
      ;; Check if we're at the end of the Yas field
      (when-let* ((_ (overlayp yas--active-field-overlay))
                  (end (overlay-end yas--active-field-overlay)))
        (if (>= (point) end)
            ;; Call yas-next-field if cdlatex can't expand here
            (let ((s (thing-at-point 'sexp)))
              (unless (and s (assoc (substring-no-properties s)
                                    cdlatex-command-alist-comb))
                (yas-next-field-or-maybe-expand)
                t))
          ;; otherwise expand and jump to the correct location
          (let (cdlatex-tab-hook minp)
            (setq minp
                  (min (save-excursion (cdlatex-tab)
                                       (point))
                       (overlay-end yas--active-field-overlay)))
            (goto-char minp) t)))))

#+end_src

** End

#+begin_src emacs-lisp

  (provide 'init-tex)

#+end_src

* Package
:PROPERTIES:
:header-args: :tangle ./lisp/init-package.el
:END:

Emacs Package management configurations.

** Header

#+begin_src emacs-lisp

  ;; -*- lexical-binding: t -*-

  (require 'init-custom)
  (require 'init-funcs)
	
#+end_src

** Save selected packages

#+begin_src emacs-lisp

  ;; HACK: DO NOT copy package-selected-packages to init/custom file forcibly.
  ;; https://github.com/jwiegley/use-package/issues/383#issuecomment-247801751
  (defun my/save-selected-packages (&optional value)
    "Set `package-selected-packages' to VALUE but don't save to `custom-file'."
    (when value
      (setq package-selected-packages value)))
  (advice-add 'package--save-selected-packages :override #'my/save-selected-packages)
	
#+end_src

** Set ELPA packages

#+begin_src emacs-lisp

  (set-package-archives centaur-package-archives nil nil t)
	
#+end_src

** Initialize packages

#+begin_src emacs-lisp

  (unless (bound-and-true-p package--initialized) ; To avoid warnings in 27
    (setq package-enable-at-startup nil)          ; To prevent initializing twice
    (package-initialize))

#+end_src

** use-pakcage

#+begin_src emacs-lisp

  ;; Setup `use-package'
  (unless (package-installed-p 'use-package)
    (package-refresh-contents)
    (package-install 'use-package))

  ;; Should set before loading `use-package'
  (eval-and-compile
    (setq use-package-always-ensure        t)
    (setq use-package-always-defer         t)
    (setq use-package-expand-minimally     t)
    (setq use-package-enable-imenu-support t))

  (eval-when-compile
    (require 'use-package))

  ;; Required by `use-package'
  (use-package diminish)
  (use-package bind-key)

#+end_src

** Update GPG keyring for GNU ELPA

#+begin_src emacs-lisp

  (use-package gnu-elpa-keyring-update)
	
#+end_src

** Auto update packages

#+begin_src emacs-lisp

  (use-package auto-package-update
    :init
    (setq auto-package-update-delete-old-versions t
          auto-package-update-hide-results t)
    (defalias 'upgrade-packages #'auto-package-update-now))

#+end_src

** End

#+begin_src emacs-lisp
	
  (provide 'init-package)

#+end_src

* Prog
:PROPERTIES:
:header-args: :tangle ./lisp/init-prog.el
:END:

General programming configurations.

** Header

#+begin_src emacs-lisp

  ;; -*- lexical-binding: t -*-
	
  (require 'init-custom)

#+end_src

** dump-mode

Jump to definition

#+begin_src emacs-lisp

  (use-package dumb-jump
    :bind (("M-g o" . dumb-jump-go-other-window)
           ("M-g j" . dumb-jump-go)
           ("M-g i" . dumb-jump-go-prompt)
           ("M-g x" . dumb-jump-go-prefer-external)
           ("M-g z" . dumb-jump-go-prefer-external-other-window)
           ("C-M-j" . dumb-jump-hydra/body))
    :init
    (add-hook 'xref-backend-functions #'dumb-jump-xref-activate)
    (setq dumb-jump-prefer-searcher 'rg
          dumb-jump-selector        'ivy))

#+end_src

** css-mode

#+begin_src emacs-lisp

  (use-package css-mode
    :ensure nil
    :config
    (setq css-fontify-colors nil))

#+end_src

** makefile-mode

#+begin_src emacs-lisp

  (use-package makefile-mode
    :ensure nil
    :hook (makefile-mode . enable-tabs))

#+end_src

** lua-mode

#+begin_src emacs-lisp

  (use-package lua-mode
    :after evil
    :config
    (evil-define-key 'normal lua-mode-map (kbd "K") nil))

#+end_src

** Misc

#+begin_src emacs-lisp

  (use-package yaml-mode)
  (use-package vimrc-mode)
  (use-package fish-mode)

#+end_src

** End

#+begin_src emacs-lisp

  (provide 'init-prog)
	
#+end_src

* Projectile
:PROPERTIES:
:header-args: :tangle ./lisp/init-projectile.el
:END:

Projectile configurations.

** Header

#+begin_src emacs-lisp

  ;; -*- lexical-binding: t -*-
	
#+end_src

** projectile

Manage and navigate projects

#+begin_src emacs-lisp

  (use-package projectile
    :diminish
    :bind (:map projectile-mode-map
                ("C-c p" . projectile-command-map))
    :hook (after-init . projectile-mode)
    :init
    (setq projectile-mode-line-prefix    ""
          projectile-sort-order          'recentf
          projectile-use-git-grep        t
          projectile-enable-caching      t
          projectile-project-search-path '("~/Cloud/Projects"
                                           "~/Nextcloud/Projects"
                                           "~/Projects"))
    :config
    (projectile-update-mode-line)         ; Update mode-line at the first time

    ;; Use the faster searcher to handle project files: ripgrep `rg'.
    (when (and (not (executable-find "fd"))
               (executable-find "rg"))
      (setq projectile-generic-command
            (let ((rg-cmd ""))
              (dolist (dir projectile-globally-ignored-directories)
                (setq rg-cmd (format "%s --glob '!%s'" rg-cmd dir)))
              (concat "rg -0 --files --color=never --hidden" rg-cmd)))))

#+end_src

** End

#+begin_src emacs-lisp

  (provide 'init-projectile)
	
#+end_src

* Treemacs
:PROPERTIES:
:header-args: :tangle ./lisp/init-treemacs.el
:END:

Treemacs: A tree layout file explorer.

** Header

#+begin_src emacs-lisp

  ;; -*- lexical-binding: t -*-

  (require 'init-custom)
  (require 'init-evil)
  (require 'init-vcs)

#+end_src

