emacs.d.org
** which-key

Display available keybindings in popup

#+begin_src emacs-lisp

  (use-package which-key
    :diminish
    :hook (after-init . which-key-mode)
    :init
    (setq which-key-max-description-length 30
          which-key-show-remaining-keys    t))

#+end_src

** real-auto-save

#+begin_src emacs-lisp

  (use-package real-auto-save
    :hook (find-file . real-auto-save-mode)
    :config
    (setq real-auto-save-interval 1))

#+end_src

** command-log-mode

#+begin_src emacs-lisp

  (use-package posframe)
  (use-package command-log-mode
    :after posframe)

  (setq my/command-window-frame nil)

  (defun my/toggle-command-window ()
    (interactive)
    (if my/command-window-frame
        (progn
          (posframe-delete-frame clm/command-log-buffer)
          (setq my/command-window-frame nil)
          (command-log-mode 0))
      (progn
        (command-log-mode t)
        (global-command-log-mode t)
        (with-current-buffer
            (setq clm/command-log-buffer
                  (get-buffer-create " *command-log*")))
        (setq my/command-window-frame
              (posframe-show
               clm/command-log-buffer
               :position `(,(- (x-display-pixel-width) 450) . 20)
               :width 40
               :height 7
               :min-width 40
               :min-height 7
               :background-color "#21242b"
               :internal-border-width 2
               :internal-border-color "#32424b"
               :override-parameters '((parent-frame . nil)))))))

  (leader-key-def
    "cl" 'my/toggle-command-window)

#+end_src

** COMMENT Search tools

Writable 'grep' buffer

#+begin_src emacs-lisp

  (use-package wgrep
    :init
    (setq wgrep-auto-save-buffer t
          wgrep-change-readonly-file t))

  ;; Fast search tool `ripgrep'
  (use-package rg
    :defines projectile-command-map
    :hook (after-init . rg-enable-default-bindings)
    :bind (:map rg-global-map
                ("c" . rg-dwim-current-dir)
                ("f" . rg-dwim-current-file)
                ("m" . rg-menu)
                :map rg-mode-map
                ("m" . rg-menu))
    :init (setq rg-group-result t
                rg-show-columns t)
    :config
    (cl-pushnew '("tmpl" . "*.tmpl") rg-custom-type-aliases)

    (with-eval-after-load 'projectile
      (defalias 'projectile-ripgrep #'rg-project)
      (bind-key "s R" #'rg-project projectile-command-map))

    (with-eval-after-load 'counsel
      (bind-keys
       :map rg-global-map
       ("R" . counsel-rg)
       ("F" . counsel-fzf))))

#+end_src

** COMMENT Process

#+begin_src emacs-lisp

  (use-package proced
    :ensure nil
    :init
    (setq-default proced-format 'verbose)
    (setq proced-auto-update-flag t
          proced-auto-update-interval 3))

#+end_src

** Misc

#+begin_src emacs-lisp

  (use-package copyit)                    ; copy path, url, etc.
  (use-package esup)                      ; Emacs startup profiler
  (use-package list-environment)
  (use-package memory-usage)
  (use-package daemons)                   ; system services/daemons

#+end_src

** End

#+begin_src emacs-lisp

  (provide 'init-utils)
	
#+end_src

* VCS
:PROPERTIES:
:header-args: :tangle ./lisp/init-vcs.el
:END:

Version control systems.

** Header

#+begin_src emacs-lisp

  ;; -*- lexical-binding: t -*-

#+end_src

** magit

#+begin_src emacs-lisp

  (use-package magit
    :bind ((:map magit-status-mode-map
                 ("j" . magit-next-line)
                 ("k" . magit-previous-line)
                 ("J" . magit-section-forward)
                 ("K" . magit-section-backward)
                 ("v" . evil-visual-line))
           (:map magit-log-mode-map
                 ("j" . magit-next-line)
                 ("k" . magit-previous-line))
           (:map magit-revision-mode-map
                 ("j" . magit-next-line)
                 ("k" . magit-previous-line)
                 ("J" . magit-section-forward)
                 ("K" . magit-section-backward))
           (:map magit-diff-mode-map
                 ("j" . magit-next-line)
                 ("k" . magit-previous-line)
                 ("J" . magit-section-forward)
                 ("K" . magit-section-backward))
           (:map transient-base-map
                 ("<escape>" . transient-quit-one)))
    :init
    (leader-key-def "g" 'magit-status)
    :custom
    (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1)
    :config
    (leader-key-def
      :keymaps 'magit-status-mode-map
      "u"   'magit-section-up
      "q"   'magit-mode-bury-buffer
      "TAB" 'magit-section-show-level-2-all)
    (leader-key-def
      :keymaps 'magit-log-mode-map
      "q"   'magit-log-bury-buffer)
    (leader-key-def
      "ef" 'with-editor-finish))

#+end_src

** COMMENT git-timemachine

Walk through git revisions of a file

#+begin_src emacs-lisp

  (use-package git-timemachine
    :custom-face
    (git-timemachine-minibuffer-author-face ((t (:inherit success))))
    (git-timemachine-minibuffer-detail-face ((t (:inherit warning))))
    :bind (:map vc-prefix-map
           ("t" . git-timemachine))
    :hook (before-revert . (lambda ()
                             (when (bound-and-true-p git-timemachine-mode)
                               (user-error "Cannot revert the timemachine buffer")))))
	
#+end_src

** End

#+begin_src emacs-lisp

  (provide 'init-vcs)
	
#+end_src

* Window
:PROPERTIES:
:header-args: :tangle ./lisp/init-window.el
:END:

Window configurations.

** Header

#+begin_src emacs-lisp

  ;; -*- lexical-binding: t -*-

#+end_src

** zoom

#+begin_src emacs-lisp

  (use-package zoom
    :init
    (custom-set-variables
     '(zoom-size                        '(0.618 . 0.618))
     '(zoom-mode                        t)
     '(zoom-ignored-buffer-names        '("COMMIT_EDITMSG"
                                          " *command-log*"
                                          "*Ilist*"))
     '(zoom-ignored-buffer-name-regexps '("^magit-diff"
                                          "^<tree>.*"
                                          ".*LaTeX environment"
                                          ".*LaTeX fragment")))

    (advice-add 'balance-windows :override (lambda () nil)))

#+end_src

** ace-window

Quickly switch windows

#+begin_src emacs-lisp

  (use-package ace-window
    :hook (emacs-startup . ace-window-display-mode)
    :config
    (defun aw--select-window (number)
      "Slecet the specified window."
      (when (numberp number)
        (let ((found nil))
          (dolist (win (aw-window-list))
            (when (and (window-live-p win)
                       (eq number
                           (string-to-number
                            (window-parameter win 'ace-window-path))))
              (setq found t)
              (aw-switch-to-window win)))
          (unless found
            (message "No specified window: %d" number)))))

    (dotimes (n 9)
      (bind-key (format "M-%d" (1+ n))
                (lambda ()
                  (interactive)
                  (aw--select-window (1+ n))))))

#+end_src

