lisp/init-snippets.el
;; -*- lexical-binding: t -*-

(require 'warnings)

(use-package yasnippet
  :diminish yas-minor-mode
  :hook (after-init . yas-global-mode)
  :config
  (add-to-list 'warning-suppress-types '(yasnippet backquote-change))

  (defun my/delete-one-blank-line ()
    (interactive)
    (save-excursion
      (if (re-search-forward "^[[:space:]]*$" nil t)
          (kill-whole-line)))))

(defun my/change-lang-in-snippet ()
  (shell-command-to-string "xkb-switch -n")
  (remove-hook 'yas/after-exit-snippet-hook 'my/change-lang-in-snippet t))

(defun my/temp-abort-snippet ()
  (yas-abort-snippet)
  (remove-hook 'post-command-hook #'my/temp-abort-snippet))

(use-package aas
  :hook (LaTeX-mode . aas-activate-for-major-mode)
  :config
