lisp/init-snippets.el
  
  
  (aas-set-snippets 'org-mode
                    "tm"  (lambda ()
                            (interactive)
                            (if (my/current-line-empty-p)
                                (progn
                                  (yas-expand-snippet (yas-lookup-snippet "theorem"))
                                  (my/delete-one-blank-line))
                              (insert "tm")))
                    "еь"  (lambda ()
                            (interactive)
                            (if (my/current-line-empty-p)
                                (progn
                                  (yas-expand-snippet (yas-lookup-snippet "theorem"))
                                  (my/delete-one-blank-line))
                              (insert "еь")))
                    "lm" (lambda ()
                           (interactive)
                           (if (my/current-line-empty-p)
                               (progn
                                 (yas-expand-snippet (yas-lookup-snippet "lemma"))
                                 (my/delete-one-blank-line))
                             (insert "lm")))
                    "дь" (lambda ()
                           (interactive)
                           (if (my/current-line-empty-p)
                               (progn
                                 (yas-expand-snippet (yas-lookup-snippet "lemma"))
                                 (my/delete-one-blank-line))
                             (insert "дь")))
                    "mk"  (lambda ()
                            (interactive)
                            (yas-expand-snippet "\\\\($0\\\\)")
                            (my/org-edit-special)
                            (evil-insert-state)
                            (search-forward "(" nil t nil))
                    "ьл"  (lambda ()
                            (interactive)
                            (yas-expand-snippet "\\\\($0\\\\)")
                            (my/org-edit-special)
                            (evil-insert-state)
                            (search-forward "(" nil t nil))
                    "ms"  (lambda ()
                            (interactive)
                            (yas-expand-snippet "\\\\($1\\\\)$0"))
                    "ьы"  (lambda ()
                            (interactive)
                            (shell-command-to-string "xdotool key Mode_switch")
                            (yas-expand-snippet "\\\\($1\\\\)$0")
                            (add-hook 'yas/after-exit-snippet-hook 'my/change-lang-in-snippet 0 t))
                    "dm"  (lambda ()
                            (interactive)
                            (if (my/current-line-empty-p)
                                (progn
                                  (yas-expand-snippet (yas-lookup-snippet "display math"))
                                  (my/delete-one-blank-line))
                              (insert "dm")))
                    "вь"  (lambda ()
                            (interactive)
                            (if (my/current-line-empty-p)
                                (progn
                                  (yas-expand-snippet (yas-lookup-snippet "display math"))
                                  (my/delete-one-blank-line))
                              (insert "вь")))
                    ";fg" (lambda ()
                            (interactive)
                            (yas-expand-snippet (yas-lookup-snippet "figure")))
                    "жап" (lambda ()
                            (interactive)
                            (shell-command-to-string "xdotool key Mode_switch")
                            (yas-expand-snippet (yas-lookup-snippet "figure")))
                    ";im" (lambda ()
                            (interactive)
                            (my/insert-image))
                    "жшь" (lambda ()
                            (interactive)
                            (my/insert-image)))
  
  (aas-set-snippets 'org-mode
                    :cond #'texmathp
                    "->"    "\\to "
                    ">>"    "\\gg "
                    "<<"    "\\ll "
                    "<="    "\\leq "
                    ">="    "\\geq "
                    ";="    "\\neq "
                    "pm"    "\\pm "
                    "mp"    "\\mp "
                    "~~"    "\\sim "
                    "~="    "\\approx "
                    ";a"    "\\alpha "
                    ";b"    "\\beta "
                    ";g"    "\\gamma "
                    ";G"    "\\Gamma "
                    ";d"    "\\delta "
                    ";D"    "\\Delta "
                    ";e"    "\\vepsilon "
                    ";E"    "\\Vepsilon "
                    ";z"    "\\zeta "
                    ";n"    "\\eta "
                    ";q"    "\\theta "
                    ";Q"    "\\Theta "
                    ";i"    "\\iota "
                    ";k"    "\\kappa "
                    ";l"    "\\lambda "
                    ";L"    "\\Lambda "
                    ";m"    "\\mu "
                    ";v"    "\\nu "
                    ";x"    "\\xi "
                    ";X"    "\\Xi "
                    ";p"    "\\pi "
                    ";P"    "\\Pi "
                    ";r"    "\\rho "
                    ";s"    "\\sigma "
                    ";S"    "\\Sigma "
                    ";t"    "\\tau "
                    ";u"    "\\upsilon "
                    ";U"    "\\Upsilon "
                    ";f"    "\\vphi "
                    ";F"    "\\Phi "
                    ";o"    "\\chi "
                    ";y"    "\\psi "
                    ";Y"    "\\Psi "
                    ";w"    "\\omega "
                    ";W"    "\\Omega "
                    ";h"    "\\hbar "
                    ";8"    "\\infty "
                    "per"   "\\perp "
                    "par"   "\\parallel "
                    "ang"   "\\angle "
                    "dg"    "\\degree "
                    "ua"    "\\ua "
                    "da"    "\\da "
                    "uua"   "\\uua "
                    "uda"   "\\uda "
                    "AA"    "\\forall "
                    "EE"    "\\exists "
                    "nEE"   "\\nexists "
                    "div"   "\\div "
                    "sr"    "^2"
                    "cb"    "^3"
                    "inv"   "^{-1}"
                    "td"    (lambda ()
                              (interactive)
                              (yas-expand-snippet "^{$1}"))
                    "vc"    (lambda ()
                              (interactive)
                              (yas-expand-snippet "\\vec{$1}$0"))
                    "tri"   (lambda ()
                              (interactive)
                              (yas-expand-snippet "\\triangle ${1:ABC}$0")
                              (add-hook 'post-command-hook #'my/temp-abort-snippet)))
  
  
  (aas-set-snippets 'latex-mode
                    :cond (lambda ()
                            (not (texmathp)))
                    "mk"  (lambda ()
                            (interactive)
                            (yas-expand-snippet "$$1$"))
                    "ьл"  (lambda ()
                            (interactive)
                            (shell-command-to-string "xdotool key Mode_switch")
                            (yas-expand-snippet "$$1$")
                            (add-hook 'yas/after-exit-snippet-hook 'my/change-lang-in-snippet 0 t))
                    "dm"  (lambda ()
                            (interactive)
