emacs.d.org
** End

#+begin_src emacs-lisp

  (provide 'init-snippets)

#+end_src

